#+TITLE: Kapitel 16: Java Grundlagen 
#+INCLUDE: "../template/header.org"

#+STARTUP: showeverything
# TODO states: looks like this has to go on main file and cannot be
# included 
#+TODO: TODO(t) | UEBUNG(u) DONE(d)
#+OPTIONS: tasks:todo

#+LATEX_HEADER: \setcounter{chapter}{16}

*** Beispiel 

- Hier wird die Zahl ~int~ 42 zunächst in die entsprechende
  ~double~ 42.0 umgewandelt
- Dann passiert die Addition 
- Ergebnis hat Wert ~double~ 

#+BEGIN_SRC java :exports both :results output :classname XXX
(42 + 17.11)
#+END_SRC 

#+RESULTS:
: $1 ==> 59.11

*** Mit Initialisierung 

Die initialisierenden Literale müssen von passendem Typ sein 

#+BEGIN_SRC java :exports both :results output :classname XXX
int x = 42;
short y = 17, z=11;
char u = 'a';
#+END_SRC 

#+RESULTS:
: x ==> 42
: y ==> 17
: z ==> 11
: u ==> 'a'

*** Fehler bei Initialisierung 

Welche dieser drei Anweisungen scheitert/n? 

#+BEGIN_SRC java :exports both :results output :classname XXX
int x = 'a';
short y = 99999;
char u = 65;
#+END_SRC 

#+RESULTS:
: x ==> 97
: u ==> 'A'

** Zuweisungen, Fall 1: gleicher, einfacher Typ 

#+BEGIN_SRC java :exports both :results output :classname XXX
int x = 42;
int y; 

y = x + 1;

char u='a';
char b;
b = u;
#+END_SRC 

#+RESULTS:
: x ==> 42
: y ==> 0
: y ==> 43
: u ==> 'a'
: b ==> ''
: b ==> 'a'

** Zuweisungen, Fall 2: kompatibler, einfacher Typ 

Tatsächlich sind bereits die einfachen Beispiel von dieser Natur: 
- Der Wert 17 ist eigentlich ein ~byte~
- Aber da ~byte~ an ~short~ und ~short~ and ~int~ zugewiesen werden
  darf, ist das kein Problem 

#+BEGIN_SRC java :exports both :results output :classname XXX
int x; 
x = 17;

float a = 3.14f;
double b; 
b = a;
#+END_SRC 

#+RESULTS:
: x ==> 0
: x ==> 17
: a ==> 3.14
: b ==> 0.0
: b ==> 3.140000104904175


** Zuweisung mit expliziten typecasts 

Wie wandelt man Typen explizit in einander um? 
- Aufforderung an den Compiler, den Verlust an Werten, Genauigkeit,
  ... zu akzeptieren 
- Notation: Den Zieltyp in Klammern vor den Ausdruck schreiben
- Funktioniert auch in Teilausdrücken 

#+BEGIN_SRC java :exports code :results output :classname XXX
int x; 
double y = 42.17;
x = (int) y;
x = (int) (y + 0.0001);
x = x + (int) 0.00001;
#+END_SRC 

#+RESULTS:
: x ==> 0
: y ==> 42.17
: x ==> 42
: x ==> 42
: x ==> 42


** Kopie des  Werts einer Referenzvariable? 

- Herstellen einer Kopie zur Zuweisung alleine nicht möglich!
- Wir brauchen eine Methode, die das Kopieren übernimmt
- Beispiel Array: Wir müssen jeden einzelnen Eintrag des Arrays
  kopieren
  - Arrays definieren Methode: ~clone~


#+BEGIN_SRC java :exports code :results output :classname ZuweisungA
  %%tutor -l java
  public class CopyArray {
    public static void main(String[] args) {
      // Ein Array deklarieren und initialisieren: 
      int[] a1 = {1, 2, 3};
      int[] a2;
      a2 = a1.clone();
      System.out.println(a2[1]);
      a1[1] = 17;
      System.out.println(a2[1]);
    }
  }
#+END_SRC 

#+RESULTS:
: 2
: 2

*** UEBUNG Deepcopy? Array of Array? 

deep copy - Aspekte verstehen 

#+BEGIN_SRC java :exports code :results output :classname DeepCopyArray 
  public class DeepCopyArray {
    public static void main(String[] args) {
      // Ein Array deklarieren und initialisieren: 
      int[][] a1 = {{1, 2, 3}, {4,5,6}};
      int[][] a2;
      a2 = a1.clone();
      System.out.println(a2[1][1]);
      a1[1][1] = 17;
      System.out.println(a2[1][1]);
    }
  }
#+END_SRC 

#+RESULTS:
: 5
: 17

** ~while~-Schleife: Beispiel für Muster 

Addieren wir die ersten 10 Zahlen auf:

#+BEGIN_SRC java :exports both :results output :classname XXX
  //Variable für Ergebnis: 
  int summe=0;
  // zaehler initialisieren: 
  int zaehler=1;
  while (zaehler <= 10) {
      // Eigentliche Aktion: 
      summe += zaehler;

      // Zähler erhöhen
      zaehler += 1;
  }
  System.out.println(summe);
#+END_SRC 

#+RESULTS:
: summe ==> 0
: zaehler ==> 1
: 55

*** Option 2: Variable in Schleifenkopf deklarieren 

- Damit eindeutig als Zählvariable für die Schleife markiert 
- Verschwindet nach der Schleife aus dem Scope
- Wenn nach Schleife Bedingung geprüft werden soll, dafür separate
  Variable vorsehen!
- Meist als besserer Stil angesehen 


#+BEGIN_SRC java :exports code :results output :classname ForVariable
public class ForVariable {
  public static void main(String[] args) {
      for (int i= 5; i<8; i++) System.out.print(i + ", ");

  // Variable i out of scope, das geht nicht: 
  // System.out.print(i);
  }
}
#+END_SRC 

#+RESULTS:
: 5, 6, 7, 


** Klassisches ~for~: Beispiel 

Geben wir die Zahlen 1 bis 10 aus 

#+BEGIN_SRC java :exports both :results output :classname XXX
  int i;
  for (i = 1;
       i <= 10;
       i++)
      System.out.println(i);

  // und zum Beweis: i hat auch nach der for-Schleife den letzten Wert 
  System.out.println(i);
#+END_SRC 

#+RESULTS:
#+begin_example
i ==> 0
1
2
3
4
5
6
7
8
9
10
11
#+end_example

** Beispiel: Multiplikationstabelle ausgeben 

Geben wir eine Multiplikationstabelle für die Zahlen 1 bis 10 aus 

#+BEGIN_SRC java :exports both :results output :classname XXX
  int i, j;

  // Kopfzeile der Tabelle
  System.out.print("i\t")
  for (j=1; j <= 10; j++)
      System.out.print("|\t" + j);
  Systme.out.println("\n---------------------------");

  // die eigentliche Tabelle: 
  for (i=1; i<=10; i++) {
      System.out.print(i + "\t");
      for (j=1; j<=10; j++) {
          System.out.print("|\t");
          System.out.printf("%4s", i*j);
      }
      System.out.println();
  }
#+END_SRC 

#+RESULTS:
#+begin_example
i ==> 0
j ==> 0
i	
|	1|	2|	3|	4|	5|	6|	7|	8|	9|	10
1	|	   1|	   2|	   3|	   4|	   5|	   6|	   7|	   8|	   9|	  10
2	|	   2|	   4|	   6|	   8|	  10|	  12|	  14|	  16|	  18|	  20
3	|	   3|	   6|	   9|	  12|	  15|	  18|	  21|	  24|	  27|	  30
4	|	   4|	   8|	  12|	  16|	  20|	  24|	  28|	  32|	  36|	  40
5	|	   5|	  10|	  15|	  20|	  25|	  30|	  35|	  40|	  45|	  50
6	|	   6|	  12|	  18|	  24|	  30|	  36|	  42|	  48|	  54|	  60
7	|	   7|	  14|	  21|	  28|	  35|	  42|	  49|	  56|	  63|	  70
8	|	   8|	  16|	  24|	  32|	  40|	  48|	  56|	  64|	  72|	  80
9	|	   9|	  18|	  27|	  36|	  45|	  54|	  63|	  72|	  81|	  90
10	|	  10|	  20|	  30|	  40|	  50|	  60|	  70|	  80|	  90|	 100
#+end_example


** Modernes ~for~: Iterator 

- Java kennt für Aufzählungen auch eine ~for~-Schleife mit einem Iterator
  - Sehr ähnlich zu Pythons ~for~-Schleife
  - Die Schleifenvariable wird hier in der ~for~-Anweisung samt
    richtigem Typ deklariert 
- Beispiel: 

#+BEGIN_SRC java :exports both :results output :classname ForIterator
// Ein Array deklarieren und initialisieren: 
int[] primzahlen = {2, 3, 5, 7, 11, 13};
for (int p: primzahlen)
    System.out.print(p + " ");
#+END_SRC 

#+RESULTS:
: primzahlen ==> [I@6e1567f1
: 2 3 5 7 11 13 


